const ValidarTexto = (texto, num=false) => {
    if(num===false){
        var regex = /^[a-zA-ZáéíóúÁÉÍÓÚäëïöüÄËÏÖÜñÑçÇßẞàÀèÈêÊБВГДбвгджфяΔαβγδεΩあいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊ가나다라마바사아자차你好中国书中文谢谢 ]*$/;
    }else{
        var regex = /^[a-zA-ZáéíóúÁÉÍÓÚäëïöüÄËÏÖÜñÑçÇßẞàÀèÈêÊБВГДбвгджфяΔαβγδεΩあいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊ가나다라마바사아자차你好中国书中文谢谢 0-9]*$/;
    }
    if(regex.test(texto)){
        return true;
    }else{
        return false;
    }
}

export default {ValidarTexto}